Masmiseim36/iMXRT/targets/iMXRT/devices/iMXRT1180/startup_MIMXRT118C_cm7.s
/*****************************************************************************
 * Copyright (c) 2018 Rowley Associates Limited.                             *
 * Modified work Copyright (C) 2021-2026 Markus Klein                        *
 *                                                                           *
 * This file may be distributed under the terms of the License Agreement     *
 * provided with this software.                                              *
 *                                                                           *
 * THIS FILE IS PROVIDED AS IS WITH NO WARRANTY OF ANY KIND, INCLUDING THE   *
 * WARRANTY OF DESIGN, MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE. *
 *****************************************************************************/
/*****************************************************************************
 *                           Preprocessor Definitions
 *                           ------------------------
 *
 * STARTUP_FROM_RESET
 *
 *   If defined, the program will startup from power-on/reset. If not defined
 *   the program will just loop endlessly from power-on/reset.
 *
 *   This definition is not defined by default on this target because the
 *   debugger is unable to reset this target and maintain control of it over the
 *   JTAG interface. The advantage of doing this is that it allows the debugger
 *   to reset the CPU and run programs from a known reset CPU state on each run.
 *   It also acts as a safety net if you accidently download a program in FLASH
 *   that crashes and prevents the debugger from taking control over JTAG
 *   rendering the target unusable over JTAG. The obvious disadvantage of doing
 *   this is that your application will not startup without the debugger.
 *
 *   We advise that on this target you keep STARTUP_FROM_RESET undefined whilst
 *   you are developing and only define STARTUP_FROM_RESET when development is
 *   complete.
 *
 * __NO_SYSTEM_INIT
 *
 *   If defined, the SystemInit() function will NOT be called. By default SystemInit()
 *   is called after reset to enable the clocks and memories to be initialised
 *   prior to any C startup initialisation.
 *
 * VECTORS_IN_RAM
 *
 *   If defined then the exception vectors are copied from Flash to RAM
 *
 * DISABLE_ECC_ON_STARTUP
 *
 *   If defined then the ECC functionality is disabled on start-up
 *
 * __NO_FPU
 *
 *   If defined do NOT turn on the FPU
 *
 * __NO_RUNFAST_MODE
 *
 *   If defined do NOT turn on flush-to-zero and default NaN modes
 *
 *****************************************************************************/

.macro ISR_HANDLER name=
  .section .vectors, "ax"
  .word \name
  .section .init, "ax"
  .thumb_func
  .weak \name
\name:
1: b 1b /* endless loop */
.endm

.macro ISR_HANDLER2 name=
  .section .vectors, "ax"
  .word \name\()_IRQHandler
  .section .init, "ax"
  .thumb_func
  .weak \name\()_IRQHandler
\name\()_IRQHandler:
1: b \name\()_DriverIRQHandler
  .thumb_func
  .weak \name\()_DriverIRQHandler
\name\()_DriverIRQHandler:
1: b 1b
.endm

.macro ISR_RESERVED
  .section .vectors, "ax"
  .word 0
.endm

  .syntax unified
  .global reset_handler
  .global Reset_Handler

  .section .vectors, "ax"
  .code 16
  .global _vectors
_vectors:
  .global __Vectors
__Vectors:
  .global g_pfnVectors
g_pfnVectors:
   .long   __stack_end__
#ifdef STARTUP_FROM_RESET
  .word reset_handler
#else
  .word reset_wait
#endif /* STARTUP_FROM_RESET */
ISR_HANDLER NMI_Handler                         // The NMI handler
ISR_HANDLER HardFault_Handler                   // The hard fault handler
ISR_HANDLER MemManage_Handler                   // The MPU fault handler
ISR_HANDLER BusFault_Handler                    // The bus fault handler
ISR_HANDLER UsageFault_Handler                  // The usage fault handler
ISR_RESERVED
ISR_RESERVED
ISR_RESERVED
ISR_RESERVED
ISR_HANDLER SVC_Handler
ISR_HANDLER DebugMon_Handler
ISR_RESERVED
ISR_HANDLER PendSV_Handler
ISR_HANDLER SysTick_Handler
  // External Interrupts
ISR_HANDLER2 TMR1                                 // vTMR1_IRQHandler                                  - TMR1 interrupt
ISR_HANDLER2 DAP                                  // vDAP_IRQHandler                                   - DAP interrupt
ISR_HANDLER2 M7_CTI_TRIGGER_OUTPUT                // vM7_CTI_TRIGGER_OUTPUT_IRQHandler                 - CTI trigger outputs from CM7
ISR_HANDLER2 M33_CTI_TRIGGER_OUTPUT               // vM33_CTI_TRIGGER_OUTPUT_IRQHandler                - CTI trigger outputs from CM33
ISR_HANDLER2 TMR5                                 // vTMR5_IRQHandler                                  - TMR5 interrupt
ISR_HANDLER2 TMR6                                 // vTMR6_IRQHandler                                  - TMR6 interrupt
ISR_HANDLER2 TMR7                                 // vTMR7_IRQHandler                                  - TMR7 interrupt
ISR_HANDLER2 TMR8                                 // vTMR8_IRQHandler                                  - TMR8 interrupt
ISR_HANDLER2 CAN1                                 // vCAN1_IRQHandler                                  - CAN1 interrupt
ISR_HANDLER2 CAN1_ERROR                           // vCAN1_ERROR_IRQHandler                            - CAN1 error interrupt
ISR_HANDLER2 GPIO1_0                              // vGPIO1_0_IRQHandler                               - GPIO1 interrupt 0
ISR_HANDLER2 GPIO1_1                              // vGPIO1_1_IRQHandler                               - GPIO1 interrupt 1
ISR_HANDLER2 I3C1                                 // vI3C1_IRQHandler                                  - I3C1 interrupt
ISR_HANDLER2 LPI2C1                               // vLPI2C1_IRQHandler                                - LPI2C1 interrupt
ISR_HANDLER2 LPI2C2                               // vLPI2C2_IRQHandler                                - LPI2C2 interrupt
ISR_HANDLER2 LPIT1                                // vLPIT1_IRQHandler                                 - LPIT1 interrupt
ISR_HANDLER2 LPSPI1                               // vLPSPI1_IRQHandler                                - LPSPI1 interrupt
ISR_HANDLER2 LPSPI2                               // vLPSPI2_IRQHandler                                - LPSPI2 interrupt
ISR_HANDLER2 LPTMR1                               // vLPTMR1_IRQHandler                                - LPTMR1 interrupt
ISR_HANDLER2 LPUART1                              // vLPUART1_IRQHandler                               - LPUART1 interrupt
ISR_HANDLER2 LPUART2                              // vLPUART2_IRQHandler                               - LPUART2 interrupt
ISR_HANDLER2 MU1                                  // vMU1_IRQHandler                                   - MU1 interrupt
ISR_HANDLER2 MU2                                  // vMU2_IRQHandler                                   - MU2 interrupt
ISR_HANDLER2 PWM1_FAULT                           // vPWM1_FAULT_IRQHandler                            - PWM1 fault or reload error interrupt
ISR_HANDLER2 PWM1_0                               // vPWM1_0_IRQHandler                                - PWM1 capture 0, compare 0, or reload 0 interrupt
ISR_HANDLER2 PWM1_1                               // vPWM1_1_IRQHandler                                - PWM1 capture 1, compare 1, or reload 1 interrupt
ISR_HANDLER2 PWM1_2                               // vPWM1_2_IRQHandler                                - PWM1 capture 2, compare 2, or reload 2 interrupt
ISR_HANDLER2 PWM1_3                               // vPWM1_3_IRQHandler                                - PWM1 capture 3, compare 3, or reload 3 interrupt
ISR_HANDLER2 EDGELOCK_TRUST_MUA_RX_FULL           // vEDGELOCK_TRUST_MUA_RX_FULL_IRQHandler            - Edgelock Trust MUA RX full interrupt
ISR_HANDLER2 EDGELOCK_TRUST_MUA_TX_EMPTY          // vEDGELOCK_TRUST_MUA_TX_EMPTY_IRQHandler           - Edgelock Trust MUA TX empty interrupt
ISR_HANDLER2 EDGELOCK_APPS_CORE_MUA_RX_FULL       // vEDGELOCK_APPS_CORE_MUA_RX_FULL_IRQHandler        - Edgelock Apps Core MUA RX full interrupt
ISR_HANDLER2 EDGELOCK_APPS_CORE_MUA_TX_EMPTY      // vEDGELOCK_APPS_CORE_MUA_TX_EMPTY_IRQHandler       - Edgelock Apps Core MUA TX empty interrupt
ISR_HANDLER2 EDGELOCK_REALTIME_CORE_MUA_RX_FULL   // vEDGELOCK_REALTIME_CORE_MUA_RX_FULL_IRQHandler    - Edgelock Realtime Core MUA RX full interrupt
ISR_HANDLER2 EDGELOCK_REALTIME_CORE_MUA_TX_EMPTY  // vEDGELOCK_REALTIME_CORE_MUA_TX_EMPTY_IRQHandler   - Edgelock Realtime Core MUA TX empty interrupt
ISR_HANDLER2 EDGELOCK_SECURE                      // vEDGELOCK_SECURE_IRQHandler                       - Edgelock secure interrupt
ISR_HANDLER2 EDGELOCK_NONSECURE                   // vEDGELOCK_NONSECURE_IRQHandler                    - Edgelock non-secure interrupt
ISR_HANDLER2 TPM1                                 // vTPM1_IRQHandler                                  - TPM1 interrupt
ISR_HANDLER2 TPM2                                 // vTPM2_IRQHandler                                  - TPM2 interrupt
ISR_HANDLER2 RTWDOG1                              // vRTWDOG1_IRQHandler                               - RTWDOG1 interrupt
ISR_HANDLER2 RTWDOG2                              // vRTWDOG2_IRQHandler                               - RTWDOG2 interrupt
ISR_HANDLER2 TRDC_MGR_AON                         // vTRDC_MGR_AON_IRQHandler                          - AONMIX TRDC transfer error interrupt
ISR_HANDLER2 PDM_HWVAD_EVENT                      // vPDM_HWVAD_EVENT_IRQHandler                       - HWVAD event interrupt
ISR_HANDLER2 PDM_HWVAD_ERROR                      // vPDM_HWVAD_ERROR_IRQHandler                       - HWVAD error interrupt
ISR_HANDLER2 PDM_EVENT                            // vPDM_EVENT_IRQHandler                             - PDM event interrupt
ISR_HANDLER2 PDM_ERROR                            // vPDM_ERROR_IRQHandler                             - PDM error interrupt
ISR_HANDLER2 SAI1                                 // vSAI1_IRQHandler                                  - SAI interrupt
ISR_HANDLER2 CM33_PS                              // vCM33_PS_IRQHandler                               - M33 PS Tag/Data Parity Error
ISR_HANDLER2 CM33_TCM_ECC                         // vCM33_TCM_ECC_IRQHandler                          - M33 TCM ECC interrupt
ISR_HANDLER2 CM33_TCM_ERROR                       // vCM33_TCM_ERROR_IRQHandler                        - M33 TCM Error interrupt
ISR_HANDLER2 CM7_TCM_ECC                          // vCM7_TCM_ECC_IRQHandler                           - M7 TCM ECC interrupt
ISR_HANDLER2 CM7_TCM_ERROR                        // vCM7_TCM_ERROR_IRQHandler                         - M7 TCM Error interrupt
ISR_RESERVED                                      // vReserved67_IRQHandler                            - Reserved interrupt
ISR_RESERVED                                      // vReserved68_IRQHandler                            - Reserved interrupt
ISR_HANDLER2 FLEXIO1                              // vFLEXIO1_IRQHandler                               - FLEXIO1 interrupt
ISR_HANDLER2 FLEXIO2                              // vFLEXIO2_IRQHandler                               - FLEXIO2 interrupt
ISR_HANDLER2 FLEXSPI1                             // vFLEXSPI1_IRQHandler                              - FLEXSPI1 interrupt
ISR_HANDLER2 FLEXSPI2                             // vFLEXSPI2_IRQHandler                              - FLEXSPI2 interrupt
ISR_HANDLER2 GPIO2_0                              // vGPIO2_0_IRQHandler                               - GPIO2 interrupt 0
ISR_HANDLER2 GPIO2_1                              // vGPIO2_1_IRQHandler                               - GPIO2 interrupt 1
ISR_HANDLER2 GPIO3_0                              // vGPIO3_0_IRQHandler                               - GPIO3 interrupt 0
ISR_HANDLER2 GPIO3_1                              // vGPIO3_1_IRQHandler                               - GPIO3 interrupt 1
ISR_HANDLER2 I3C2                                 // vI3C2_IRQHandler                                  - I3C2 interrupt
ISR_HANDLER2 LPI2C3                               // vLPI2C3_IRQHandler                                - LPI2C3 interrupt
ISR_RESERVED                                      // vReserved79_IRQHandler                            - Reserved interrupt
ISR_HANDLER2 LPIT2                                // vLPIT2_IRQHandler                                 - LPIT2 interrupt
ISR_HANDLER2 LPSPI3                               // vLPSPI3_IRQHandler                                - LPSPI3 interrupt
ISR_HANDLER2 LPSPI4                               // vLPSPI4_IRQHandler                                - LPSPI4 interrupt
ISR_HANDLER2 LPTMR2                               // vLPTMR2_IRQHandler                                - LPTMR2 interrupt
ISR_HANDLER2 LPUART3                              // vLPUART3_IRQHandler                               - LPUART3 interrupt
ISR_HANDLER2 LPUART4                              // vLPUART4_IRQHandler                               - LPUART4 interrupt
ISR_HANDLER2 LPUART5                              // vLPUART5_IRQHandler                               - LPUART5 interrupt
ISR_HANDLER2 LPUART6                              // vLPUART6_IRQHandler                               - LPUART6 interrupt
ISR_RESERVED                                      // vReserved88_IRQHandler                            - Reserved interrupt 88
ISR_HANDLER2 BBNSM                                // vBBNSM_IRQHandler                                 - BBNSM iterrupt
ISR_HANDLER2 SYS_CTR1                             // vSYS_CTR1_IRQHandler                              - System Counter compare interrupt 0 and 1
ISR_HANDLER2 TPM3                                 // vTPM3_IRQHandler                                  - TPM3 interrupt
ISR_HANDLER2 TPM4                                 // vTPM4_IRQHandler                                  - TPM4 interrupt
ISR_RESERVED                                      // vReserved93_IRQHandler                            - Reserved interrupt
ISR_RESERVED                                      // vReserved94_IRQHandler                            - Reserved interrupt
ISR_HANDLER2 RTWDOG3                              // vRTWDOG3_IRQHandler                               - RTWDOG3 interrupt
ISR_HANDLER2 RTWDOG4                              // vRTWDOG4_IRQHandler                               - RTWDOG4 interrupt
ISR_HANDLER2 RTWDOG5                              // vRTWDOG5_IRQHandler                               - RTWDOG5 interrupt
ISR_HANDLER2 TRDC_MGR_WKUP                        // vTRDC_MGR_WKUP_IRQHandler                         - WAKEUPMIX TRDC transfer error interrupt
ISR_HANDLER2 TMPSNS_INT                           // vTMPSNS_INT_IRQHandler                            - Temperature alarm interrupt
ISR_HANDLER2 BBSM                                 // vBBSM_IRQHandler                                  - BBSM wakeup alarm interrupt
ISR_HANDLER2 LDO_AON_ANA                          // vLDO_AON_ANA_IRQHandler                           - Brown out interrupt
ISR_RESERVED                                      // vReserved102_IRQHandler                           - Reserved interrupt
ISR_HANDLER2 USDHC2                               // vUSDHC2_IRQHandler                                - USDHC2
ISR_HANDLER2 TRDC_MGR_MEGA                        // vTRDC_MGR_MEGA_IRQHandler                         - MEGAMIX TRDC transfer error interrupt
ISR_HANDLER2 SFA                                  // vSFA_IRQHandler                                   - Signal Frequency Analyzer interrupt
ISR_HANDLER2 LDO_AON_DIG                          // vLDO_AON_DIG_IRQHandler                           - Brown out interrupt
ISR_HANDLER2 MECC1                                // vMECC1_IRQHandler                                 - MECC1 interrupt
ISR_HANDLER2 MECC2                                // vMECC2_IRQHandler                                 - MECC2 interrupt
ISR_HANDLER2 ADC1                                 // vADC1_IRQHandler                                  - ADC1 interrupt
ISR_HANDLER2 DMA_ERROR                            // vDMA_ERROR_IRQHandler                             - AON Domain eDMA error interrupt
ISR_HANDLER2 DMA3_CH0                             // vDMA3_CH0_IRQHandler                              - AON Domain eDMA channel 0 interrupt
ISR_HANDLER2 DMA3_CH1                             // vDMA3_CH1_IRQHandler                              - AON Domain eDMA channel 1 interrupt
ISR_HANDLER2 DMA3_CH2                             // vDMA3_CH2_IRQHandler                              - AON Domain eDMA channel 2 interrupt
ISR_HANDLER2 DMA3_CH3                             // vDMA3_CH3_IRQHandler                              - AON Domain eDMA channel 3 interrupt
ISR_HANDLER2 DMA3_CH4                             // vDMA3_CH4_IRQHandler                              - AON Domain eDMA channel 4 interrupt
ISR_HANDLER2 DMA3_CH5                             // vDMA3_CH5_IRQHandler                              - AON Domain eDMA channel 5 interrupt
ISR_HANDLER2 DMA3_CH6                             // vDMA3_CH6_IRQHandler                              - AON Domain eDMA channel 6 interrupt
ISR_HANDLER2 DMA3_CH7                             // vDMA3_CH7_IRQHandler                              - AON Domain eDMA channel 7 interrupt
ISR_HANDLER2 DMA3_CH8                             // vDMA3_CH8_IRQHandler                              - AON Domain eDMA channel 8 interrupt
ISR_HANDLER2 DMA3_CH9                             // vDMA3_CH9_IRQHandler                              - AON Domain eDMA channel 9 interrupt
ISR_HANDLER2 DMA3_CH10                            // vDMA3_CH10_IRQHandler                             - AON Domain eDMA channel 10 interrupt
ISR_HANDLER2 DMA3_CH11                            // vDMA3_CH11_IRQHandler                             - AON Domain eDMA channel 11 interrupt
ISR_HANDLER2 DMA3_CH12                            // vDMA3_CH12_IRQHandler                             - AON Domain eDMA channel 12 interrupt
ISR_HANDLER2 DMA3_CH13                            // vDMA3_CH13_IRQHandler                             - AON Domain eDMA channel 13 interrupt
ISR_HANDLER2 DMA3_CH14                            // vDMA3_CH14_IRQHandler                             - AON Domain eDMA channel 14 interrupt
ISR_HANDLER2 DMA3_CH15                            // vDMA3_CH15_IRQHandler                             - AON Domain eDMA channel 15 interrupt
ISR_HANDLER2 DMA3_CH16                            // vDMA3_CH16_IRQHandler                             - AON Domain eDMA channel 16 interrupt
ISR_HANDLER2 DMA3_CH17                            // vDMA3_CH17_IRQHandler                             - AON Domain eDMA channel 17 interrupt
ISR_HANDLER2 DMA3_CH18                            // vDMA3_CH18_IRQHandler                             - AON Domain eDMA channel 18 interrupt
ISR_HANDLER2 DMA3_CH19                            // vDMA3_CH19_IRQHandler                             - AON Domain eDMA channel 19 interrupt
ISR_HANDLER2 DMA3_CH20                            // vDMA3_CH20_IRQHandler                             - AON Domain eDMA channel 20 interrupt
ISR_HANDLER2 DMA3_CH21                            // vDMA3_CH21_IRQHandler                             - AON Domain eDMA channel 21 interrupt
ISR_HANDLER2 DMA3_CH22                            // vDMA3_CH22_IRQHandler                             - AON Domain eDMA channel 22 interrupt
ISR_HANDLER2 DMA3_CH23                            // vDMA3_CH23_IRQHandler                             - AON Domain eDMA channel 23 interrupt
ISR_HANDLER2 DMA3_CH24                            // vDMA3_CH24_IRQHandler                             - AON Domain eDMA channel 24 interrupt
ISR_HANDLER2 DMA3_CH25                            // vDMA3_CH25_IRQHandler                             - AON Domain eDMA channel 25 interrupt
ISR_HANDLER2 DMA3_CH26                            // vDMA3_CH26_IRQHandler                             - AON Domain eDMA channel 26 interrupt
ISR_HANDLER2 DMA3_CH27                            // vDMA3_CH27_IRQHandler                             - AON Domain eDMA channel 27 interrupt
ISR_HANDLER2 DMA3_CH28                            // vDMA3_CH28_IRQHandler                             - AON Domain eDMA channel 28 interrupt
ISR_HANDLER2 DMA3_CH29                            // vDMA3_CH29_IRQHandler                             - AON Domain eDMA channel 29 interrupt
ISR_HANDLER2 DMA3_CH30                            // vDMA3_CH30_IRQHandler                             - AON Domain eDMA channel 30 interrupt
ISR_HANDLER2 DMA3_CH31                            // vDMA3_CH31_IRQHandler                             - AON Domain eDMA channel 31 interrupt
ISR_HANDLER2 DMA4_ERROR                           // vDMA4_ERROR_IRQHandler                            - WAKEUP Domain eDMA error interrupt
ISR_HANDLER2 DMA4_CH0_CH1_CH32_CH33               // vDMA4_CH0_CH1_CH32_CH33_IRQHandler                - WAKEUP Domain eDMA channel 0/1/32/33 interrupt
ISR_HANDLER2 DMA4_CH2_CH3_CH34_CH35               // vDMA4_CH2_CH3_CH34_CH35_IRQHandler                - WAKEUP Domain eDMA channel 2/3/34/35 interrupt
ISR_HANDLER2 DMA4_CH4_CH5_CH36_CH37               // vDMA4_CH4_CH5_CH36_CH37_IRQHandler                - WAKEUP Domain eDMA channel 4/5/36/37 interrupt
ISR_HANDLER2 DMA4_CH6_CH7_CH38_CH39               // vDMA4_CH6_CH7_CH38_CH39_IRQHandler                - WAKEUP Domain eDMA channel 6/7/38/39 interrupt
ISR_HANDLER2 DMA4_CH8_CH9_CH40_CH41               // vDMA4_CH8_CH9_CH40_CH41_IRQHandler                - WAKEUP Domain eDMA channel 8/9/40/41 interrupt
ISR_HANDLER2 DMA4_CH10_CH11_CH42_CH43             // vDMA4_CH10_CH11_CH42_CH43_IRQHandler              - WAKEUP Domain eDMA channel 10/11/42/43 interrupt
ISR_HANDLER2 DMA4_CH12_CH13_CH44_CH45             // vDMA4_CH12_CH13_CH44_CH45_IRQHandler              - WAKEUP Domain eDMA channel 12/13/44/45 interrupt
ISR_HANDLER2 DMA4_CH14_CH15_CH46_CH47             // vDMA4_CH14_CH15_CH46_CH47_IRQHandler              - WAKEUP Domain eDMA channel 14/15/46/47 interrupt
ISR_HANDLER2 DMA4_CH16_CH17_CH48_CH49             // vDMA4_CH16_CH17_CH48_CH49_IRQHandler              - WAKEUP Domain eDMA channel 16/17/48/49 interrupt
ISR_HANDLER2 DMA4_CH18_CH19_CH50_CH51             // vDMA4_CH18_CH19_CH50_CH51_IRQHandler              - WAKEUP Domain eDMA channel 18/19/50/51 interrupt
ISR_HANDLER2 DMA4_CH20_CH21_CH52_CH53             // vDMA4_CH20_CH21_CH52_CH53_IRQHandler              - WAKEUP Domain eDMA channel 20/21/52/53 interrupt
ISR_HANDLER2 DMA4_CH22_CH23_CH54_CH55             // vDMA4_CH22_CH23_CH54_CH55_IRQHandler              - WAKEUP Domain eDMA channel 22/23/54/55 interrupt
ISR_HANDLER2 DMA4_CH24_CH25_CH56_CH57             // vDMA4_CH24_CH25_CH56_CH57_IRQHandler              - WAKEUP Domain eDMA channel 24/25/56/57 interrupt
ISR_HANDLER2 DMA4_CH26_CH27_CH58_CH59             // vDMA4_CH26_CH27_CH58_CH59_IRQHandler              - WAKEUP Domain eDMA channel 26/27/58/59 interrupt
ISR_HANDLER2 DMA4_CH28_CH29_CH60_CH61             // vDMA4_CH28_CH29_CH60_CH61_IRQHandler              - WAKEUP Domain eDMA channel 28/29/60/61 interrupt
ISR_HANDLER2 DMA4_CH30_CH31_CH62_CH63             // vDMA4_CH30_CH31_CH62_CH63_IRQHandler              - WAKEUP Domain eDMA channel 30/31/62/63 interrupt
ISR_HANDLER2 XBAR1_CH0_CH1                        // vXBAR1_CH0_CH1_IRQHandler                         - XBAR1 channel 0/1 interrupt
ISR_HANDLER2 XBAR1_CH2_CH3                        // vXBAR1_CH2_CH3_IRQHandler                         - XBAR1 channel 2/3 interrupt
ISR_HANDLER2 SINC3_CH0_CH1_CH2_CH3                // vSINC3_CH0_CH1_CH2_CH3_IRQHandler                 - SINC Filter Glue 3 channel 0/1/2/3
ISR_HANDLER2 EWM                                  // vEWM_IRQHandler                                   - EWM reset out interrupt
ISR_HANDLER2 SEMC                                 // vSEMC_IRQHandler                                  - SEMC interrupt
